---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures
source: html/4488ecc8-243f-b6b5-ff98-ad780cd0bdc2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures

Failures about placing viewports on sheets.

## Syntax (C#)
```csharp
public static class ViewSheetFailures
```